In [1]:
d2={ "a":56,
   23:"abcf",
    45:"344"}
d2

{'a': 56, 23: 'abcf', 45: '344'}

In [2]:
import pandas as pd
ser = pd.Series(d2)
ser

a       56
23    abcf
45     344
dtype: object

In [3]:
data = ['1','w','4','ty']
data

['1', 'w', '4', 'ty']

In [5]:
data = pd.Series(data,index=[5,6,7,8])
data

5     1
6     w
7     4
8    ty
dtype: object

In [6]:
data = { "Name":["jm",'jt','ab','ps'],"marks":[90,94,95,99]}
data

{'Name': ['jm', 'jt', 'ab', 'ps'], 'marks': [90, 94, 95, 99]}

In [7]:
df=pd.DataFrame(data)
df

  Name  marks
0   jm     90
1   jt     94
2   ab     95
3   ps     99

In [8]:
l1= ["jm",'jt','ab','ps']
l2= [90,94,95,99]
data = {"Name":l1,"Marks":l2}
data

{'Name': ['jm', 'jt', 'ab', 'ps'], 'Marks': [90, 94, 95, 99]}

In [11]:
df=pd.DataFrame(data)
df

  Name  Marks
0   jm     90
1   jt     94
2   ab     95
3   ps     99

Giving It an Index:

In [12]:
df=pd.DataFrame(data,index=[1,2,3,4])
df

  Name  Marks
1   jm     90
2   jt     94
3   ab     95
4   ps     99